taskt/Core/Automation/Commands/ExcelGroup/IExcelRowRangeProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IExcelRowRangeProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.AExcelRowRangeCommands" [ label="AExcelRowRangeCommands", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRowRangeProperties" [ label="IExcelRowRangeProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" [ label="IExcelRowRangeGetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelRowRangeSetProperties" [ label="IExcelRowRangeSetProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AExcelRowRangeGetCommands" [ label="AExcelRowRangeGetCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AExcelRowRangeSetCommands" [ label="AExcelRowRangeSetCommands", style="dashed", ];
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsDictionaryCommand" [ label="ExcelGetRowValuesAsDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsDataTableCommand" [ label="ExcelGetRowValuesAsDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsListCommand" [ label="ExcelGetRowValuesAsListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromDataTableCommand" [ label="ExcelSetRowValuesFromDataTableCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromDictionaryCommand" [ label="ExcelSetRowValuesFromDictionaryCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromListCommand" [ label="ExcelSetRowValuesFromListCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.AExcelRowRangeCommands" -> "taskt.Core.Automation.Commands.IExcelRowRangeProperties";
"taskt.Core.Automation.Commands.IExcelRowRangeGetProperties" -> "taskt.Core.Automation.Commands.IExcelRowRangeProperties";
"taskt.Core.Automation.Commands.IExcelRowRangeSetProperties" -> "taskt.Core.Automation.Commands.IExcelRowRangeProperties";
"taskt.Core.Automation.Commands.AExcelRowRangeGetCommands" -> "taskt.Core.Automation.Commands.AExcelRowRangeCommands";
"taskt.Core.Automation.Commands.AExcelRowRangeSetCommands" -> "taskt.Core.Automation.Commands.AExcelRowRangeCommands";
"taskt.Core.Automation.Commands.AExcelRowRangeGetCommands" -> "taskt.Core.Automation.Commands.IExcelRowRangeGetProperties";
"taskt.Core.Automation.Commands.AExcelRowRangeSetCommands" -> "taskt.Core.Automation.Commands.IExcelRowRangeSetProperties";
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsDictionaryCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeGetCommands";
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsDataTableCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeGetCommands";
"taskt.Core.Automation.Commands.ExcelGetRowValuesAsListCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeGetCommands";
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromDataTableCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeSetCommands";
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromDictionaryCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeSetCommands";
"taskt.Core.Automation.Commands.ExcelSetRowValuesFromListCommand" -> "taskt.Core.Automation.Commands.AExcelRowRangeSetCommands";
}
